coocox/Mplib/Toshaba/TMPM37x/TMPM370/cmsis_lib/lib/src/tmpm370_cg.c
    if (Source == CG_FOSC_OSC1) {
        if (NewState == ENABLE) {
            /* Enable high-speed oscillation */
            TSB_CG_OSCCR_XEN1 = 1U;
            retval = SUCCESS;
        } else {
            /* Disable high-speed oscillation */
            TSB_CG_OSCCR_XEN1 = 0U;
            retval = SUCCESS;
        }
    } else {
        retval = ERROR;
    }

    return retval;

#endif                          /*defined(__TMPM370_CG_H) */

#if defined(__TMPM372_CG_H) || defined(__TMPM373_CG_H) || \
    defined(__TMPM374_CG_H)

    CG_FoscSrc fosc_src = CG_FOSC_OSC2;
    Result retval = ERROR;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_CG_FOSC_SRC(Source));

    switch (Source) {
    case CG_FOSC_OSC1:
        if (TSB_CG_OSCCR_HOSCON != 0U) {
            if (NewState == ENABLE) {
                /* Enable high-speed oscillator */
                TSB_CG_OSCCR_XEN1 = 1U;
                retval = SUCCESS;
            } else {
                fosc_src = CG_GetFoscSrc();
                if (fosc_src == CG_FOSC_OSC1) {
                    /* fosc1 is in  use, so it can't be disabled */
                    retval = ERROR;
                } else {
                    /* Disable high-speed oscillator1 */
                    TSB_CG_OSCCR_XEN1 = 0U;
                    retval = SUCCESS;
                }
            }
        } else {
            /* Do nothing */
        }

        break;
    case CG_FOSC_OSC2:
        if (NewState == ENABLE) {
            /* Enable high-speed oscillator */
            TSB_CG_OSCCR_XEN2 = 1U;
            retval = SUCCESS;
        } else {
            fosc_src = CG_GetFoscSrc();
            if (fosc_src == CG_FOSC_OSC2) {
                /* fosc2 is in  use, so it can't be disabled */
                retval = ERROR;
            } else {
                /* Disable high-speed oscillator2 */
                TSB_CG_OSCCR_XEN2 = 0U;
                retval = SUCCESS;
            }
        }
        break;
    default:
        /* Do nothing */
        break;
    }

    return retval;

#endif                          /* defined(__TMPM372_CG_H) || defined(__TMPM373_CG_H) || */
                                /* defined(__TMPM374_CG_H) */
}

#if defined(__TMPM372_CG_H) || defined(__TMPM373_CG_H) || \
    defined(__TMPM374_CG_H)
/**
  * @brief  Set the source of high-speed oscillator (fosc)
  * @param  Source: Select clock source for fosc
  *   This parameter can be one of the following values:
  *   CG_FOSC_OSC1 : External
  *   CG_FOSC_OSC2 : Internal (For M372/M373/M374)
  * @retval None
  */
void CG_SetFoscSrc(CG_FoscSrc Source)
{
    /* Check the parameters */
    assert_param(IS_CG_FOSC_SRC(Source));

    if (Source == CG_FOSC_OSC1) {
        TSB_CG_OSCCR_OSCSEL = 1U;
    } else {
        TSB_CG_OSCCR_OSCSEL = 0U;
    }
}

/**
  * @brief  Get the source of high-speed oscillator (fosc)
  * @param  None
  * @retval Source of fosc
  *   The value returned can be one of the following values:
  *   CG_FOSC_OSC1 : External
  *   CG_FOSC_OSC2 : Internal (For M372/M373/M374)
  */
CG_FoscSrc CG_GetFoscSrc(void)
{
    CG_FoscSrc fosc_src = CG_FOSC_OSC1;

    if (TSB_CG_OSCCR_OSCSEL == 0U) {
        fosc_src = CG_FOSC_OSC2;
    } else {
        /* Do nothing */
    }

    return fosc_src;
}

/**
  * @brief  Set portM for X1/X2 or general port
  * @param New mode of portM.
  *   This parameter can be one of the following values:
  *   CG_PORTM_AS_GPIO or CG_PORTM_AS_HOSC
  * @retval None
  */
void CG_SetPortM(CG_PortMMode Mode)
{
    /* Check the parameters */
    assert_param(IS_CG_PROTM_FUNCTION(Mode));

    TSB_CG_OSCCR_HOSCON = Mode;
}

/**
  * @brief  Get the state of input INT.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_3(For M372), CG_INT_SRC_4(For M372/M373),
  *   CG_INT_SRC_5(For M372/M373/M374), CG_INT_SRC_6(For M372/M373/M374),
  *   CG_INT_SRC_7(For M372/M373/M374), CG_INT_SRC_8(For M372),
  *   CG_INT_SRC_C(For M372/M373/M374), CG_INT_SRC_D(For M372/M373/M374),
  *   CG_INT_SRC_E(For M372/M373/M374), CG_INT_SRC_F(For M372/M373/M374).
  * @retval The state of input INT
  */
CG_INTReqState CG_GetINTReq(CG_INTSrc INTSource)
{
    CG_INTReqState int_state = CG_NO_INT_REQ;
    uint8_t i = 0U;
    uint8_t j = 0U;
    uint8_t tmp = 0U;
    uint32_t num = 0U;
    CG_Byte4 regval[4] = { {0U}
    , {0U}
    , {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

#if defined(__TMPM372_CG_H)
    regval[0].byte4 = TSB_CG->IMCGA;
#endif
    regval[1].byte4 = TSB_CG->IMCGB;
#if defined(__TMPM372_CG_H)
    regval[2].byte4 = TSB_CG->IMCGC;
#endif
    regval[3].byte4 = TSB_CG->IMCGD;

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);
    tmp = regval[i].byte[j];
    tmp &= 0x02U;

    if (tmp == 0x02U) {
        int_state = CG_INT_REQ;
    } else {
        /* Do nothing */
    }

    return (int_state);
}
#endif                          /* defined(__TMPM372_CG_H) || defined(__TMPM373_CG_H) || */
                                /* defined(__TMPM374_CG_H) */

/**
  * @brief  Get the state of high-speed oscillator (fosc)
  * @param  Source: Select fosc source
  *   This parameter can be one of the following values:
  *   CG_FOSC_OSC1 : External
  *   CG_FOSC_OSC2 : Internal (For M372/M373/M374)
  * @retval State of fosc
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE
  */
FunctionalState CG_GetFoscState(CG_FoscSrc Source)
{
    FunctionalState state = DISABLE;

    /* Check the parameters */
    assert_param(IS_CG_FOSC_SRC(Source));

    if (Source == CG_FOSC_OSC1) {
        if (TSB_CG_OSCCR_XEN1 == 1U) {
            state = ENABLE;
        } else {
            /* Do nothing */
        }

#if defined(__TMPM372_CG_H) || defined(__TMPM373_CG_H) || \
    defined(__TMPM374_CG_H)

    } else {
        if (TSB_CG_OSCCR_XEN2 == 1U) {
            state = ENABLE;
        } else {
            /* Do nothing */
        }
#endif                          /* defined(__TMPM372_CG_H) || defined(__TMPM373_CG_H) || */
                                /* defined(__TMPM374_CG_H) */

