coocox/Mplib/Toshaba/TMPM37x/TMPM370/cmsis_lib/lib/src/tmpm370_cg.c
#if defined(__TMPM370_CG_H) || defined(__TMPM372_CG_H)
    case 2U:                   /* IMCGC */
        regval[2].byte4 = TSB_CG->IMCGC;
        regval[2].byte[j] &= 0x8eU;
        regval[2].byte[j] |= ActiveState;
        TSB_CG->IMCGC = regval[2].byte4;
        regval[2].byte[j] |= NewState;
        TSB_CG->IMCGC = regval[2].byte4;
        break;
#endif

    case 3U:                   /* IMCGD */
        regval[3].byte4 = TSB_CG->IMCGD;
        regval[3].byte[j] &= 0x8eU;
        regval[3].byte[j] |= ActiveState;
        TSB_CG->IMCGD = regval[3].byte4;
        regval[3].byte[j] |= NewState;
        TSB_CG->IMCGD = regval[3].byte4;
        break;

    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Gets the active state of INT source standby clear request
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0(For M370 only), CG_INT_SRC_1(For M370 only), 
  *   CG_INT_SRC_2(For M370 only), CG_INT_SRC_3(For M370 M372), 
  *   CG_INT_SRC_4(For M370/M372/M373), CG_INT_SRC_5, CG_INT_SRC_6, 
  *   CG_INT_SRC_7, CG_INT_SRC_8(For M370/M372), CG_INT_SRC_9(For M370 only), 
  *   CG_INT_SRC_A(For M370 only), CG_INT_SRC_B(For M370 only), 
  *   CG_INT_SRC_C, CG_INT_SRC_D, CG_INT_SRC_E, CG_INT_SRC_F.
  * @retval Active state of the input INT
  *   The value returned can be one of the following values:
  *   CG_INT_ACTIVE_STATE_FALLING, CG_INT_ACTIVE_STATE_RISING,
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES or CG_INT_ACTIVE_STATE_INVALID
  */
CG_INTActiveState CG_GetSTBYReleaseINTState(CG_INTSrc INTSource)
{
    CG_INTActiveState int_active_state = CG_INT_ACTIVE_STATE_INVALID;
    uint8_t i = 0U;
    uint8_t j = 0U;
    uint8_t tmp = 0U;
    uint32_t num = 0U;
    CG_Byte4 regval[4] = { {0U}
    , {0U}
    , {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

#if defined(__TMPM370_CG_H) || defined(__TMPM372_CG_H)
    regval[0].byte4 = TSB_CG->IMCGA;
#endif
    regval[1].byte4 = TSB_CG->IMCGB;
#if defined(__TMPM370_CG_H) || defined(__TMPM372_CG_H)
    regval[2].byte4 = TSB_CG->IMCGC;
#endif
    regval[3].byte4 = TSB_CG->IMCGD;

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);
    tmp = regval[i].byte[j];
    tmp &= 0x0CU;

    switch (tmp) {
    case 0x04U:
        int_active_state = CG_INT_ACTIVE_STATE_RISING;
        break;
    case 0x08U:
        int_active_state = CG_INT_ACTIVE_STATE_FALLING;
        break;
    case 0x0CU:
        int_active_state = CG_INT_ACTIVE_STATE_BOTH_EDGES;
        break;
    default:
        /* Do nothing */
        break;
    }

    return (int_active_state);
}

/**
  * @brief  Clears the input INT request.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0(For M370 only), CG_INT_SRC_1(For M370 only), 
  *   CG_INT_SRC_2(For M370 only), CG_INT_SRC_3(For M370 M372), 
  *   CG_INT_SRC_4(For M370/M372/M373), CG_INT_SRC_5, CG_INT_SRC_6, 
  *   CG_INT_SRC_7, CG_INT_SRC_8(For M370/M372), CG_INT_SRC_9(For M370 only), 
  *   CG_INT_SRC_A(For M370 only), CG_INT_SRC_B(For M370 only), 
  *   CG_INT_SRC_C, CG_INT_SRC_D, CG_INT_SRC_E, CG_INT_SRC_F.
  * @retval None
  */
void CG_ClearINTReq(CG_INTSrc INTSource)
{
    uint32_t regval = INTSource;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    TSB_CG->ICRCG = regval;
}

#if defined(__TMPM370_CG_H)
/**
  * @brief  Get the NMI flag that shows who triggered NMI.
  * @param  None
  * @retval NMI flag
  */
CG_NMIFactor CG_GetNMIFlag(void)
{
    CG_NMIFactor cg_nmi_factor = { 0U };

    cg_nmi_factor.All = TSB_CG->NMIFLG & (~CG_NMIFLG_MASK);

    return cg_nmi_factor;
}
#endif                          /*defined(__TMPM370_CG_H) */

/**
  * @brief  Get the type of reset reason and clear the reset flag.
  * @param  None
  * @retval Reset flag
  */
CG_ResetFlag CG_GetResetFlag(void)
{
    CG_ResetFlag reset_flag = { 0U };

    reset_flag.All = TSB_CG->RSTFLG & (~CG_RESET_FLAG_MASK);
    TSB_CG->RSTFLG = 0U;

    return reset_flag;
}

/** @} */
/* End of group CG_Exported_Functions */

/** @} */
/* End of group CG */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM370_CG_H) || defined(__TMPM372_CG_H) || */
                                /* defined(__TMPM373_CG_H) || defined(__TMPM374_CG_H) */
